{
  "backend/main.mo": "Defines core actor state and types for organizations, integrations, users, alerts, dashboards, and related comparison helpers.",
  "backend/migration.mo": "Provides migration logic converting old actor state to new structure by adding dashboard fields and initializing IDs.",
  "feature_evidence.json": "Lists feature evidence entries referencing frontend files, components, and test IDs for implemented features.",
  "frontend-file-summaries.txt": "Contains summarized descriptions of various frontend source files for reference and build planning.",
  "frontend/index.css": "Global Tailwind CSS variables and theme definitions for light and dark modes.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration defining routes for dashboards, integrations, onboarding, analysis, reports, and custom dashboards.",
  "frontend/src/components/alerts/AlertCard.tsx": "Displays an alert with severity, details, collapsible rule info, and acknowledge/dismiss actions.",
  "frontend/src/components/auth/LoginGate.tsx": "Provides a login screen using Internet Identity with a sign‑in button and branding visuals.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Renders a profile creation form that saves user name and optional email through a mutation.",
  "frontend/src/components/charts/FunnelChart.tsx": "Vertical bar chart showing funnel stages and counts using Recharts with dynamic colors.",
  "frontend/src/components/charts/TrendChart.tsx": "Line chart visualizing time‑based metrics such as placements, calls, and hours.",
  "frontend/src/components/dashboards/WidgetRenderer.tsx": "Renders KPI or trend widgets by mapping widget config to metric values and chart outputs.",
  "frontend/src/components/filters/GlobalFilterBar.tsx": "Provides global filters for date range, recruiter, and client with popovers and selects.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout with navigation, sidebar, user role‑based routing, and logout handling.",
  "frontend/src/components/reports/AIReportRenderer.tsx": "Renders an AI-generated report with KPI cards, an optional data table, and narrative text using shadcn UI components.",
  "frontend/src/data/analyticsSchema.ts": "Defines star-schema dimension and fact table interfaces plus sample data for recruiters, jobs, clients, and performance metrics.",
  "frontend/src/data/sampleData.ts": "Generates dashboard metrics, funnel, trend data, and alerts using filtered star‑schema fact tables.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useGlobalFilters.ts": "Zustand store persisting global dashboard filter state with update and reset helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for user profiles, roles, organizations, and mappings with invalidate logic.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying global border and body styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/admin/AdminRoleAssignmentPage.tsx": "Provides an admin UI to assign roles to principals using a form with role selection and backend mutation.",
  "frontend/src/pages/alerts/AlertsPage.tsx": "Displays active and acknowledged alerts with actions to acknowledge or dismiss, using generated sample alert data.",
  "frontend/src/pages/analysis/FunnelAnalysisPage.tsx": "Renders funnel analytics and conversion metrics using sample data and global filters, including top-performer insights.",
  "frontend/src/pages/dashboards/AllMetricsDashboardPage.tsx": "Generates a comprehensive KPI dashboard from sample metrics and revenue data with dynamic KPI cards.",
  "frontend/src/pages/dashboards/CustomDashboardBuilderPage.tsx": "Provides an interface to name, select, order, and save custom dashboard widgets via backend mutation.",
  "frontend/src/pages/dashboards/CustomDashboardPage.tsx": "Loads a user-created dashboard by ID, checks ownership, applies global filters, and renders its widgets or error/loading states.",
  "frontend/src/pages/dashboards/DashboardHubPage.tsx": "Displays categorized dashboard, analysis, report, and custom views based on user role, including an AI generator panel.",
  "frontend/src/pages/dashboards/LeadershipDashboardPage.tsx": "Shows leadership KPIs, funnel data, and trends with global filters, adapting metrics for staffing vs non-staffing orgs.",
  "frontend/src/pages/dashboards/OpsHrDashboardPage.tsx": "Presents ops/HR metrics like utilization, burnout risk, data completeness, and contractor counts plus data gap details.",
  "frontend/src/pages/dashboards/PrototypeAIGeneratorPanel.tsx": "Provides a text-based AI query tool that parses user input into a dashboard template and navigable result.",
  "frontend/src/pages/dashboards/RecruiterDashboardPage.tsx": "Displays recruiter KPIs including calls, hours, pipeline movement, interviews, offers, and related tables using global filters.",
  "frontend/src/pages/data-health/DataHealthDashboardPage.tsx": "Renders a data health dashboard with an overall score, severity breakdowns, and issue tables driven by global filters.",
  "frontend/src/pages/integrations/IntegrationSettingsPanel.tsx": "Provides controls to connect or configure an integration, toggle sample data, and manage API key settings.",
  "frontend/src/pages/integrations/IntegrationsPage.tsx": "Displays a list of integrations with connection status, sync info, and actions to manage or view details.",
  "frontend/src/pages/integrations/LoxoIntegrationPage.tsx": "Shows detailed configuration and status for the Loxo integration including settings and synced data stats.",
  "frontend/src/pages/integrations/ManageIntegrationDrawer.tsx": "A sliding drawer that wraps IntegrationSettingsPanel for editing integration settings.",
  "frontend/src/pages/leaderboards/LeaderboardsPage.tsx": "Builds leaderboards for individuals or teams with metric selection, goals, rankings, and progress indicators.",
  "frontend/src/pages/mapping/UserMappingPage.tsx": "Displays auto-matched and unmatched user mappings across multiple systems in a table.",
  "frontend/src/pages/onboarding/OnboardingWizardPage.tsx": "Implements a multi‑step onboarding wizard with navigation, progress tracking, and step‑specific validation based on org configuration.",
  "frontend/src/pages/onboarding/steps/ConfirmGenerateStep.tsx": "Displays a final review of org type, connected integrations, and user mapping before dashboard generation.",
  "frontend/src/pages/onboarding/steps/ConnectAircallStep.tsx": "Handles connecting Aircall via API key or sample data and updates org integration state.",
  "frontend/src/pages/onboarding/steps/ConnectLoxoStep.tsx": "Allows connecting Loxo using an API key or sample data and reflects connection status.",
  "frontend/src/pages/onboarding/steps/ConnectTimesheetsStep.tsx": "Manages timesheet integration setup including provider selection, API key entry, or CSV upload.",
  "frontend/src/pages/onboarding/steps/OrgTypeStep.tsx": "Lets users select their organization type, updating org configuration accordingly.",
  "frontend/src/pages/onboarding/steps/UserMappingStep.tsx": "Shows automatically generated cross‑system user mappings using sample data.",
  "frontend/src/pages/reports/ReportsAndExportsPage.tsx": "UI page enabling dashboard exports and AI-generated reports, managing user inputs and invoking export and AI utilities.",
  "frontend/src/state/leaderboardGoalsStore.ts": "Persisted Zustand store managing goal periods and per-recruiter/team metric targets with default initialization.",
  "frontend/src/state/orgContext.tsx": "Context and persisted Zustand store for organization configuration and integration settings with update helpers.",
  "frontend/src/utils/aiReports.ts": "Deterministic AI report generator mapping queries to metric computations, producing structured KPI, table, and narrative outputs.",
  "frontend/src/utils/dashboardWidgetLibrary.ts": "Registry of widget definitions describing KPIs and trend charts with metadata for dashboard rendering.",
  "frontend/src/utils/dataHealth.ts": "Computes data health issues and scores using rule-based checks over filtered analytics data.",
  "frontend/src/utils/exporters/index.ts": "Simple CSV, PDF, and PPT export utilities generating basic content and triggering file downloads.",
  "frontend/src/utils/filters.ts": "Provides shared filtering utilities for calls, hours, pipeline, and placements using date ranges and recruiter/client/job criteria.",
  "frontend/src/utils/formatting.ts": "Contains numeric, currency, percent, duration, and goal‑progress formatting helpers with graceful fallback handling.",
  "frontend/src/utils/leaderboards.ts": "Computes individual and team leaderboards by applying filters and aggregating calls, hours, placements, or revenue.",
  "frontend/src/utils/metrics.ts": "Computes global metrics such as total calls, hours, efficiency ratios, and revenue using shared filters and schema data.",
  "frontend/src/utils/prototypeAiParser.ts": "Parses natural-language queries to infer dashboard type, date range, and grouping options.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, plugins, and container settings for the frontend.",
  "project_state.json": "Defines the project’s state and requirements for a prototype B2B SaaS analytics platform integrating ATS, calling, and timesheet systems. Includes architectural notes, data modeling expectations, onboarding flow requirements, and existing feature definitions."
}